{ "session" :
	{ "chronicle": 
		{ "character" : "Floki",
		  "image" : "floki.jpg",
		  "journal" : "<p>Floki - I glanced back to my friends as I pushed my hair back out of my face in order to rub some dirt on my face. Blending in with my surroundings to scout ahead was never an easy chore. As I quickly counted the number of orcs that were visible and considered the number that I may not be able to see, the realization of what we were about to undertake hit me as vividly as when Rana used to hit me when I had awakened her by snoring.</p><p>We had made the decision to avenge Duncan and the others so quickly and so blinded by rage that simply walking into the enemy compound had seemed like our best option. I was reminded that it had only been a few months since Raenir had fallen and Danin had had a close call with the brothers of who we were about to face.</p><p>I looked carefully first at Hakaar and then Bromm as I reported what we may well encounter in a few moments to check their resolve. Mentioning the distance to home - they didn&rsquo;t even flinch. At times it was hard to tell with this bunch if it was the girth of our loins or depth of our understanding that decided our road.</p><p>Rubbing Tenner&rsquo;s chin I whispered to him &ldquo;Should I fall going forward - flee to lead your own kind, but keep a watchful eye on Rana.&rdquo; </strong></p><p>He paused for a moment and nuzzled my pack retrieving some dried meat rations.</p><p>&ldquo;Okay, have it your way, you bottomless pit. Stay with me until I give the command and you can have half now and half when we are at the tree.&rdquo;</p><p>Hakaar cleared his throat and with a low grunt he ran behind the first Orc hut. With the sound I was reminded how similar he is to his cousins we were about to cut down. The way he moved was the way they move even down to the red gleam in his eye that he often got in battle. &ldquo;Thwaap!&rdquo; &ldquo;Focus Floki&rdquo; I reminded myself. Danin has been hit by a javelin!</p>"
		},
		{ "character" : "Sig",
		  "image" : "sig.jpg",
		  "journal" : "<p>Sig - <em>What am I doing here?</em></p><p>Blood dripped down my left arm where an Orc falchion had bitten deep. It began to pool on the canvas canopy below me.</p><p><em>This is a lousy place to die, Sig. You could always just keep flying away.</em></p><p>Were those my thoughts, or was my scorpion companion speaking to me? I couldn’t be sure; exhaustion and blood loss were taking their toll.</p><p>I pushed my thoughts aside and peeked through the gap in the canvas stretched below. Hakaar and Tagaern stood side by side against an onslaught of orc warriors. Danin was soaring skyward in my direction. I couldn’t see Bròmm or Floki but I could hear the retort of Bròmm’s pepperbox and see arrow shafts protruding from orcs as they rushed our front line fighters.</p><p>Danin showed similar wounds to mine despite the armor he wore. I gave him a knowing look and without exchanging words knew he was thinking the same.</p><p><em>What the hell are we doing here?</em></p><p>Danin channeled a wave of energy and I felt my torn flesh begin to knit back together. Clarity rang through my mind. I paused and waited for Danin’s lead as I wasn’t about to jump back down in the lion’s den without him leading the charge.</p><p>“Fall back”, I bellowed down to Hakaar and Tagaern, “You’re being surrounded, fall back!”</p><p>Danin turned and plummeted toward the ground below, aiming to recover Bròmm’s abandoned musket before Hakaar and Tagaern gave their ground, but I angled back toward the tunnel as I descended to seek cover behind the wall of fur and arrows provided by Floki.</p><p>Bròmm fell back as Hakaar and Tagaern regrouped and I was reminded why we were where we were. Hakaar and Tagaern might be on a mission of revenge, but it was Bròmm’s burden that we were fighting for. In the grand scheme, this wasn’t a senseless rampage against an orc camp, but potentially, much more.</p>"
		},
		{ "character" : "Silah",
		  "image" : "silah.jpg",
		  "journal" : "Silah - <em>You are overthinking this</em>. I told him through our link.<br />Hakaar shook his head as if to chase away my words like a bothersome fly.</p><p>His heart raced and the blood in his veins was like fire. Hot enough to burn away the guilt and shame he carried at the loss of his mentor.</p><p>“I don’t think this is a good idea.” Floki said idly.</p><p>“We are doing this!” Called Tagaren in an attempt to end the argument before it could flare up again.</p><p>The chatter of the others was something I was unaccustomed to on a mission. Military units forced the hard decisions to the individual with the most experience. The others would fall in line or suffer it. By and large it was an effective way to manage the unmanageable.</p><p>I didn’t have to remind myself that these were not soldiers. They could fight and were a deadly group when they marshaled their collective will. Their trepidation eroded my confidence in the mission. Hakaar was distant too, distracted. His love for Duncan had turned to vendetta. If this was the fire in his veins, so be it, but I could not allow us to fail. If it came down to it, my mission was clear.</p><p>We managed to clear the first chamber, downing more than a dozen seasoned Orc scouts. The second chamber proved a greater challenge, but surmountable in the end.</p><p>I felt my old powers returning. With each felled opponent the feeling swelled. The haze that had encompassed me since the beginning of my bond was being burned back. My mission and my purpose have always been clear to me, but now the pieces were falling into place. Hakaar, the instrument by which I would complete my mission, was revealed to me in all his parts; greater and lesser. I understood him now the way few beings understand another. His last remaining mysteries were stripped away. I knew his mind as I know my own, knew his thoughts as he perceived them. At once, I loved and reviled him. His strengths and weaknesses, fears and desires. All these things were known to me. He was mine to create or destroy.</p><p>Bromm held the token that would stem the tide. He too would need to be managed if this enterprise was to succeed. </p><p>We wandered in the dark for a time. I pondered my new powers. <em>He</em> knew that something was different. Denial coursed throughhim like a spurned lover. A kernel of fear took root in his heart. </p><p><em>Be calm my beast.</em> I cooed.<em> Our great adventure stands before us.</em></p><p>Just as I resolved to ease his growing fears, I felt a presence. Felt the shadow of the tree before it came into view.</p><p><em>It has been a long time.</em> Came an old familiar voice.</p><p><em>See, have you missed me?</em> I queried playfully.</p><p><em>You know better than that, child of us. I have watched you in your absence. Frivolity has cast you about, delaying your arrival.</em> The voice challenged.</p><p><em>My bond needed seasoning. I thought there would be more time.</em> I protested.</p><p><em>Vigilance is our sworn duty. The affairs of mortals are not ours to indulge in.</em> He huffed.</p><p><em>I, unlike you, I did not choose this calling. I will take pleasure when it suits me.</em> I snapped.</p><p><em>Your petulance has allowed the contract to wither. Now matters are worse. Those without form have stolen the black cloud’s fury. What has happened here is but the harbinger of future ills child.</em> He lingered on the last word adding a note of condescension. His words cut deep and there was truth in them; <em>his</em> truth.</p><p><em>I do not have your sight.</em> I said. <em>I do not see all.</em></p><p><em>I have my duty, you have yours. It will be worse for them and for you.</em> He said with fatherly authority.</p><p><em>Now sacrifices will have to be made. Think on that, when next you decide to play at being a mortal.</em></p><p><em>You are just an observer!</em> I said marshaling my strength.<em> You will never understand the cost of the great bargain. I hope you rot in that tree of yours!</em></p><p>Hakaar and the others gathered at the entrance, the great tree before them. </p><p>Floki and Bromm were returning from the tree. I knew what they had seen there. Not the part about the Giant. I knew what he and his kind stood to lose. I knew how long they had waited. I knew they would not lightly give back what had been so hard won. Our only advantage was surprise.</p><p>In the hours that remained of this day friendships old and new would be tested. The price of neglect, paid by a company of friends.</p>"
		}
	},
	{ "characters" :
		{ "image": "bromm.jpg",
		  "name" : "Bromm go Brach",
		  "class" : "Gunslinger",
		  "level" : "5",
		  "experience" : "33595"
		}
	},
	{ "details" :
		{ "map" : "mapimage.jpg",
		  "calendar_start" : "6/18",
		  "calendar_end" : "6/21"
		}
	},
	{ "locations" :
		{ "location" : "Hlofreden",
		  "image" : "hlofreden.jpg"
		},
		{ "location" : "Dowry",
		  "image" : "dowry.jpg"
		}
	}
}

